//堆的路径
/*
将一系列给定数字插入一个初始为空的小顶堆H[]。
随后对任意给定的下标'i'，打印从H[i]到根节点的路径。
*/
#include <stdio.h>

#define MAXN 1001
#define MINH -10001

int H[MAXN], size;

//建立空堆
void Create()
{
    size = 0;
    //设置标兵
    H[0] = MINH;
}

//将X插入H。这里省略检查堆是否已满的代码
void Insert(int X)
{
    int i;

    //从最后向上过滤
    for (i = ++size; H[i / 2] > X; i /= 2)
        H[i] = H[i / 2];
    H[i] = X;
}

//主程序
int main()
{
    int n, m, x, i, j;
    //读入 n 和 m
    scanf("%d %d", &n, &m);

    //根据输入序列建堆，以逐个插入方式建堆
    Create();
    for (i = 0; i < n; i++)
    {
        scanf("%d", &x);
        Insert(x);
    }
    for (i = 0; i < m; i++)
    {
        scanf("%d", &j);
        printf("%d ", H[j]);
        //延根方向输出节点
        while (j > 1)
        {
            j /= 2;
            printf("%d ", H[j]);
        }
        printf("\n");
    }
    return 0;
}

/*
输入示例：
5 3                 // 5为节点数（即数下标，[0]为标兵，从1开始） 3为叶节点数量（即要输出路径的节点数）
46 23 26 24 10      // 输入5个数
5 4 3               // 输入要求路径的节点编号（即下标，[0]为标兵，从1开始）

//然后用插入的方式建最小堆 结果为 
[1]10
[2]23 [3]26
[4]46 [5]24         // [4][5]为[2]的子节点

输出示例：
24 23 10            // 下标为 5 的叶节点路径 
46 23 10            // 下标为 4 的叶节点路径
26 10               // 下标为 3 的叶节点路径
*/